Damiasroca/WittSky/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Flash — live HP10 is 4MB with ota_0/ota_1 (see partitions.csv).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# PSRAM (present in the V1.1.1 ELF: spiram_psram.c)
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# PHY calibration transmits at this power. 20 dBm trips the brownout
# detector on this board's rail. 15 dBm is the middle step.
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=15
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Camera + MJPEG need a larger httpd task than HTTPD_DEFAULT.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Isolated websocket log server (port 82). UI is :80, MJPEG is :81.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_LWIP_MAX_SOCKETS=20

# Runtime Debug/Verbose for the websocket log level selector.
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5

# Local http:// OTA servers (no TLS). https:// still uses the CRT bundle.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Stock IDF 4.4 SCCB, not IDF 5 i2c.master (HP10 sensor never ACKs on the new driver).
CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY=y
# CONFIG_SCCB_HARDWARE_I2C_DRIVER_NEW is not set
# Stock SCCB_Init @ 400e6508 uses 200 kHz on I2C port 1.
CONFIG_SCCB_HARDWARE_I2C_PORT1=y
CONFIG_SCCB_CLK_FREQ=200000
